app/controllers/visits_controller.rb

  def index
    @visits = Visit.all
---
SELECT "visits".* FROM "visits"

  def create
    @visit = Visit.new(visit_params)


    respond_to do |format|
      if @visit.save
---
INSERT INTO "visits" ("created_at", "email", "ip", "startup_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-09 03:15:35.400973"], ["email", "tucocorp@gmail.com"], ["ip", ""], ["startup_id", 2], ["updated_at", "2014-10-09 03:15:35.400973"]]

    def set_visit
      @visit = Visit.find(params[:id])
---
SELECT  "visits".* FROM "visits"  WHERE "visits"."id" = ? LIMIT 1  [["id", 3]]